export const variants = {
  bold: {
    AZ: '𝗔𝗕𝗖𝗗𝗘𝗙𝗚𝗛𝗜𝗝𝗞𝗟𝗠𝗡𝗢𝗣𝗤𝗥𝗦𝗧𝗨𝗩𝗪𝗫𝗬𝗭', az: '𝗮𝗯𝗰𝗱𝗲𝗳𝗴𝗵𝗶𝗷𝗸𝗹𝗺𝗻𝗼𝗽𝗾𝗿𝘀𝘁𝘂𝘃𝘄𝘅𝘆𝘇', '09': '𝟬𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵',
    '*': '✱', '(': '❨'/**/, ')': '❩' /**/, '<': '', '>': '', '{': '❴', '}': '❵', '!': '❢', ',': '❟', "'": '❜', '"': '❞', '+': '➕', '-': '➖', ':': '∶', '|': '❘', '_': '⎯', '~': '∼',
  },
  italic: {
    AZ: '𝘈𝘉𝘊𝘋𝘌𝘍𝘎𝘏𝘐𝘑𝘒𝘓𝘔𝘕𝘖𝘗𝘘𝘙𝘚𝘛𝘜𝘝𝘞𝘟𝘠𝘡', az: '𝘢𝘣𝘤𝘥𝘦𝘧𝘨𝘩𝘪𝘫𝘬𝘭𝘮𝘯𝘰𝘱𝘲𝘳𝘴𝘵𝘶𝘷𝘸𝘹𝘺𝘻',
    '!': '.ᐟ', '?': '.ᐣ', "'": '’', '"': '”'
  },
  bolditalic: { AZ: '𝘼𝘽𝘾𝘿𝙀𝙁𝙂𝙃𝙄𝙅𝙆𝙇𝙈𝙉𝙊𝙋𝙌𝙍𝙎𝙏𝙐𝙑𝙒𝙓𝙔𝙕', az: '𝙖𝙗𝙘𝙙𝙚𝙛𝙜𝙝𝙞𝙟𝙠𝙡𝙢𝙣𝙤𝙥𝙦𝙧𝙨𝙩𝙪𝙫𝙬𝙭𝙮𝙯' },
  fractur: { AB: '𝔄𝔅', C: 'ℭ', DG: '𝔇𝔈𝔉𝔊', HI: 'ℌℑ', JQ: '𝔍𝔎𝔏𝔐𝔑𝔒𝔓𝔔', R: 'ℜ', SY: '𝔖𝔗𝔘𝔙𝔚𝔛𝔜', Z: 'ℨ', az: '𝔞𝔟𝔠𝔡𝔢𝔣𝔤𝔥𝔦𝔧𝔨𝔩𝔪𝔫𝔬𝔭𝔮𝔯𝔰𝔱𝔲𝔳𝔴𝔵𝔶𝔷' },
  boldfractur: { AZ: '𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅', az: '𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟' },

  boldcursive: { AZ: '𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩', az: '𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃' },
  boldserif: { AZ: '𝐀𝐁𝐂𝐃𝐄𝐅𝐆𝐇𝐈𝐉𝐊𝐋𝐌𝐍𝐎𝐏𝐐𝐑𝐒𝐓𝐔𝐕𝐖𝐗𝐘𝐙', az: '𝐚𝐛𝐜𝐝𝐞𝐟𝐠𝐡𝐢𝐣𝐤𝐥𝐦𝐧𝐨𝐩𝐪𝐫𝐬𝐭𝐮𝐯𝐰𝐱𝐲𝐳' },
  italicserif: { AZ: '𝐴𝐵𝐶𝐷𝐸𝐹𝐺𝐻𝐼𝐽𝐾𝐿𝑀𝑁𝑂𝑃𝑄𝑅𝑆𝑇𝑈𝑉𝑊𝑋𝑌𝑍', ag: '𝑎𝑏𝑐𝑑𝑒𝑓𝑔', iz: '𝑖𝑗𝑘𝑙𝑚𝑛𝑜𝑝𝑞𝑟𝑠𝑡𝑢𝑣𝑤𝑥𝑦𝑧' },
  bolditalicserif: { AZ: '𝑨𝑩𝑪𝑫𝑬𝑭𝑮𝑯𝑰𝑱𝑲𝑳𝑴𝑵𝑶𝑷𝑸𝑹𝑺𝑻𝑼𝑽𝑾𝑿𝒀𝒁', az: '𝒂𝒃𝒄𝒅𝒆𝒇𝒈𝒉𝒊𝒋𝒌𝒍𝒎𝒏𝒐𝒑𝒒𝒓𝒔𝒕𝒖𝒗𝒘𝒙𝒚𝒛' },
  sansserif: { AZ: '𝖠𝖡𝖢𝖣𝖤𝖥𝖦𝖧𝖨𝖩𝖪𝖫𝖬𝖭𝖮𝖯𝖰𝖱𝖲𝖳𝖴𝖵𝖶𝖷𝖸𝖹', az: '𝖺𝖻𝖼𝖽𝖾𝖿𝗀𝗁𝗂𝗃𝗄𝗅𝗆𝗇𝗈𝗉𝗊𝗋𝗌𝗍𝗎𝗏𝗐𝗑𝗒𝗓', '09': '𝟢𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫' },

  // note: cursive e, g, o, B, E, F, H, I, L, M, R are just italicserif
  cursive: { AZ: '𝒜𝐵𝒞𝒟𝐸𝐹𝒢𝐻𝐼𝒥𝒦𝐿𝑀𝒩𝒪𝒫𝒬𝑅𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵', az: '𝒶𝒷𝒸𝒹𝑒𝒻𝑔𝒽𝒾𝒿𝓀𝓁𝓂𝓃𝑜𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏' },

  'super': {
    AP: 'ᴬᴮᶜᴰᴱᶠᴳᴴᴵᴶᴷᴸᴹᴺᴼᴾ', Q: 'ᴼ̴', RW: 'ᴿˢᵀᵁⱽᵂ', ap: 'ᵃᵇᶜᵈᵉᶠᵍʰⁱʲᵏˡᵐⁿᵒᵖ', q: '٩', rz: 'ʳˢᵗᵘᵛʷˣʸᶻ', '09': '⁰¹²³⁴⁵⁶⁷⁸⁹',
    '.': '·', ',': '⸴', '!': 'ꜝ', '(': '⁽', ')': '⁾', '=': '⁼', '+': '⁺', '-': '⁻',
  },
  box: { AZ: '🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉' },
  plate: { AZ: '🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉' },
  round: {
    AZ: 'ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ', az: 'ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ', '09': '⓪①②③④⑤⑥⑦⑧⑨',
    '+': '㊉', '-': '㊀'
   },
  typewriter: { AZ: '𝙰𝙱𝙲𝙳𝙴𝙵𝙶𝙷𝙸𝙹𝙺𝙻𝙼𝙽𝙾𝙿𝚀𝚁𝚂𝚃𝚄𝚅𝚆𝚇𝚈𝚉', az: '𝚊𝚋𝚌𝚍𝚎𝚏𝚐𝚑𝚒𝚓𝚔𝚕𝚖𝚗𝚘𝚙𝚚𝚛𝚜𝚝𝚞𝚟𝚠𝚡𝚢𝚣', '09': '𝟶𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿' },
  wide: {
    AB: '𝔸𝔹', C: 'ℂ', DG: '𝔻𝔼𝔽𝔾', H: 'ℍ', IM: '𝕀𝕁𝕂𝕃𝕄', N: 'ℕ', O: '𝕆', PR: 'ℙℚℝ', SY: '𝕊𝕋𝕌𝕍𝕎𝕏𝕐', Z: 'ℤ',
    az: '𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫', '09': '𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡',
    '{': '⦃', '}': '⦄', '(': '⦅', ')': '⦆',
  },
  joy: {
    A: 'ค' /*ᗩᗋ*/, B: 'Ᏸ', C: 'ᑕ'/*ⵛ*/, D: 'ᗪ', E: 'Ꮛ', F: 'Ƒ', G: 'Ꮆ', H: 'ⴼ', I: 'ⵊ', J: 'ᣫ'/*ᑰ*/, K: 'Ҡ'/*ꗣ*/, L: '⺃' /*Ḻ೭*/, M: 'ᗰ'/*ᙢ*/, N: 'ᑎ', O: 'ⵔ', P: 'Ꭾ' /*ᖘ*/, Q: 'Ꭴ' /*ႭႳ*/, R: 'ᖇ'/*Ꮢ*/, S: 'Ꮥ' /*𐒖ႽჂៜ*/, T: 'Ͳ' /*ፐ*/, U: 'Ꮼ', V: 'Ꮙ', W: 'Ꮗ', X: 'ⵋ', Y: 'Ꮍ', Z: 'ᘔ',
    a: 'ɑ', b: 'Ⴆ', c: 'ƈ', d: 'ԃ', e: 'ҽ', f: 'ϝ', g: 'ɠ' /*ဌ*/, h: 'Ꮒ', i: 'ἱ', j: 'ʝ', k: 'ƙ', l: 'ℓ', m: 'ɱ', n: 'ຖ', o: '໐', p: 'ρ', q: 'ϙ' /*ရ*/, r: 'ɾ', s: 'ʂ' /*ຣ*/, t: '৳', u: 'น', v: 'ง', w: 'ຟ', x: 'ϰ', y: 'ყ'/*𐒋*/, z: 'ȥ',
    '0': 'Ø'/*𐍈*/, '1': '⥠', '2': 'ᘖ'/*ឧ*/, '3': 'ჳ', '4': 'ᔰ', '5': 'Ƽ', '6': 'ꕃ', '7': '𐒇', '8': '𐌚'/*ꗚ৪*/, '9': '𐒘'/*१*/
  },
  khazad: {
    A: 'ᚤ', B: 'ᛒ' /*ꔪ*/, C: 'ᚲ', D: 'ᚦ', E: '𐌄' /*𐌔ꗨ*/, F: '𐌅', G: 'ᔦ', H: '∦'/*ỻᚺ╞〹*/, I: 'ᛂ', J: 'ᜧ', K: 'ᛕ', L: 'ᖾ', M: 'ᛖ', N: 'ᚻ', O: 'ᛜ', P: 'ᚹ', Q: 'ᛩ', R: 'ᚱ', S: 'ϟ'/*ᛊ*/, T: '𐌕' /*ᛠ*/, U: '∐', V: '߇', W: 'ᛞ', X: 'ᚷ', Y: 'ᛉ', Z: '႗'
  }
};
